Revit 2027 API
BuiltInFailures.WallFailures.VerticalLayerExtensionFailure Property
 Cannot extend layer(s) of the highlighted vertically compound wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId VerticalLayerExtensionFailure { get; }
Public Shared ReadOnly Property VerticalLayerExtensionFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ VerticalLayerExtensionFailure {
	FailureDefinitionId^ get ();
}
static member VerticalLayerExtensionFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace